{
    "DEVICE_ID": "Device ID",
    "CANCEL": "Cancel",
    "CONTINUE": "Continue",
    "CLEAR": "Clear",
    "OKAY": "Okay",
    "REFRESH": "Refresh",
    "SETTINGS": "Settings",
    "YES": "Yes",
    "OVERVIEW": {
        "TITLE": "Overview",
        "NO_KNOWN_DEVICES": "No known devices",
        "NO_KNOWN_DEVICES_DESC": "Add a device using the buttons below: Either scan the local network for available devices or manually enter a device id.",
        "DISCOVER_BUTTON": "Discover and auto pair with device",
        "MANUAL_BUTTON": "Manually pair with device",
        "REFRESH_BUTTON": "Refresh",
        "ERROR_NABTO_NOT_AVAILABLE": "Installation problem: Nabto SDK not available, please contact vendor.",
        "ERROR_DEVICE_NOT_OPEN_FOR_PAIRING": "Device not open for pairing - please contact owner (or factory reset if you are the own).",
        "ERROR_DEVICE_NOT_REACHABLE": "Device {{id}} is not reachable or is not supported.",
        "ERROR_UNKNOWN": "App could not start, please contact vendor: "
    },
    "APP_SETTINGS": {
        "TITLE": "App Settings",
        "KEY_PAIR_TITLE": "Key pair",
        "KEY_PAIR_BODY": "The public key for this {{platform}} device has the following RSA fingerprint (used to uniquely identify this device towards other systems):",
        "BUTTON_SHARE": "Share this fingerprint",
        "BUTTON_RECREATE": "Re-create keypair for this {{platform}} device",
        "KNOWN_DEVICES": "Known devices",
        "BUTTON_KNOWN_DEVICES": "Clear list of known devices",
        "ALERT_CONFIRM_HEADER": "Confirm",
        "ALERT_CLEAR_PROFILE": "Are you sure you want to remove the currently active keypair? You must factory reset devices that you are owner of to be owner again with the new key.",
        "ALERT_CLEAR_DEVICES": "Do you want to clear list of known devices?"
    },
    "ADD_DEVICE": {
        "TITLE": "Manually add device",
        "SCAN_BUTTON": "Scan QR with device ID",
        "SCAN_CANCEL": "Cancelled QR scan.",
        "CLEAR_BUTTON": "Clear device ID",
        "ADD_BUTTON": "Add device ID",
        "AC_HEADER": "Access Control",
        "AC_DESC": "<p>Your public key fingerprint must be added to the device's Access Control List before you can access the device. The device owner can add this.</p>Share your public key fingerprint here:",
        "AC_BUTTON": "Share public key fingerprint",
        "ERROR_ACCESS_DENIED": "Access denied - the device owner must add your public key fingerprint to the device access control list. Use the share button on this page to share your fingerprint with owner.",
        "ERROR_DEVICE_ACCESS": "An error occurred when accessing device",
        "ERROR_QR_MISSING_ID": "Missing device ID in QR code.",
        "ERROR_QR_INVALID_DATA": "Invalid data in QR code."
    },
    "DISCOVER": {
        "TITLE": "Discover devices",
        "LOADING": "Discovering devices...",
        "NO_DEVICES_HEADER": "No devices found on your network",
        "NO_DEVICES_BODY": "Make sure you are on the same local area network as the device you try to discover and that the device is powered on. Swipe downwards to refresh.",
        "TOAST_ALREADY_PAIRED": "Already paired",
        "ALERT_NO_INTERFACE_HEADER": "Firmware upgrade recommended",
        "ALERT_NO_INTERFACE_BODY": "This device does not support strict interface checking. It is highly recommended to upgrade the device firmware to support this (contact your vendor). Do you want to continue anyway for now?",
        "ALERT_CLOSED_DEVICE_HEADER": "Device not open",
        "ALERT_CLOSED_DEVICE_BODY": "Sorry! This device is not open for pairing, please contact the device owner. Or perform a factory reset if you are the owner of the device but don't have access."
    },
    "PAIRING": {
        "TITLE": "Pair device",
        "DESCRIPTION": "You are about to pair  your {{platform}} device with the {{product}} <em>{{name}}</em>",
        "CONFIRM": "Confirm pairing",
        "CONTINUE": "Go to your new device",
        "BACK": "Back to overview"
    },
    "PROFILE": {
        "TITLE": "Keypair creation",
        "DESCRIPTION": "Enter the name to identify this {{platform}} device when communicating with other devices.",
        "NAME": "Name to associate with keypair"
    },
    "HELP": {
        "TITLE": "Help",
        "INTRO_HEADER": "Introduction",
        "INTRO_BODY": "This app demonstrates the capabilities of the AppMyProduct platform through a simple heating control example. In the following \"target device\" denotes this heating control.",
        "PROFILE_HEADER": "Client profile",
        "PROFILE_BODY": "<p>The first time the app is started, a client profile is created, identifying this specific phone/app combination. This enables securely pairing the app with the target device.</p><p>You are prompted to associate a name with the client profile - a good choice is to include your name and the device type, this will make it simpler for device owners to recognize you if granting access.</p><p>you can re-create the client profile and set another name through the client settings page (\"settings\" wheel in upper right corner).</p>",
        "OVERVIEW_HEADER": "Overview page",
        "OVERVIEW_BODY": "<p>The overview page consists of a list of currently known target devices. A green icon indicates if it is online, a red icon and an error message if it is not available.</p><p>New devices can be added from the overview page: To add a device, your client (this app) must be on the same local area network as the target device to enable discovery.</p>",
        "PAIRING_HEADER": "Pairing devices",
        "PAIRING_BODY": "<p>When a device is discovered, you are prompted to pair your client app with the device. If this is the first time somebody pairs a client with the device, you will become owner of the device. A device can only have one owner with the default implementation.</p>",
        "AC_HEADER": "Access control",
        "AC_BODY": "<p>The owner can change device settings and control who may have access to the device. Subsequent client devices paired after the initial owner pairing will only be granted guest access - ie. only the ability to access the main functionality of the device (e.g, the actual heat control functionality).</p><p>Through the security settings page of the device, the owner can control who has access to the individual device, what their access privileges are and how open the device is for adding new users.</p>"
    },
    "DEVICE_SETTINGS": {
        "TITLE": "Device settings",
        "USER_IS_GUEST": "Only the owner of this device can change settings, you currently only have guest permissions. If you actually are the owner, you must perform a factory reset of the device.",
        "PROPERTIES_HEADER": "Properties",
        "NAME_LABEL": "Enter the name of this device, e.g. \"Kitchen\"",
        "BUTTON_COPY": "Copy",
        "SECURITY_HEADER": "Security"
    },
    "HEATING": {
        "COOL": "Cool",
        "HEAT": "Heat",
        "CIRCULATE": "Circulate",
        "DEHUMIDIFY": "Dehumidify",
        "LOADING": "Invoking device...",
        "TEMPERATURE_NOTE": "in room",
        "TOGGLE_LABEL": "Heatpump active",
        "STATUS_OFFLINE": "Device offline",
        "STATUS_POWERED_OFF": "Device powered off"
    }
}
